## Pandas Tutorial 14: Read Write Data From Database (read_sql, to_sql)
Pandas provides several methods like `read_sql()`, `read_sql_table()`, and `read_sql_query()` to read database records directly into a DataFrame. The `to_sql()` method allows writing DataFrame records to a SQL table. By using SQLAlchemy's `create_engine()`, you can easily interface with databases like MYSQL, PostgreSQL, and Oracle.

#### Topics covered:
* **Introduction**
* **Creating a SQLAlchemy Engine with `create_engine()`**
* **Reading a Table into a DataFrame with `read_sql_table()`**
* **Executing SQL Queries with `read_sql_query()`**
* **Renaming DataFrame Columns with `rename()`**
* **Writing Data to SQL Tables with `to_sql()`**
* **Reading Data with `read_sql()`**

This tutorial will guide you through connecting to databases and seamlessly interacting with SQL tables using Pandas.

!pip install PyMySQL
!pip install sqlalchemy
import pandas as pd
import sqlalchemy

## Creating a SQLAlchemy Engine
The `create_engine()` function establishes a connection to a MYSQL database using SQLAlchemy. The connection string format is:

**Key Features:**
* `mysql+pymysql`: Specifies the MYSQL database and PyMySQL driver.
* `root:password`: The username and password for the MySQL database.
* `localhost:3306`: The host and port where the MySQL server is running.
* `application`: The name of the database you're connecting to.

This engine allows you to interact with the database, execute queries, and transfer data between SQL and Pandas DataFrames.

In [17]:
# Creates a connection engine for MYSQL database
engine = sqlalchemy.create_engine('mysql+pymysql://root:password@localhost:3306/application')

## Reading a SQL Table into a DataFrane
The `read_sql_table()` function reads an entire SQL table into a Pandas DataFrame. In this example, it retrieves the `customers` table using the previously created `engine`.

**Key Features:**
* `"customers"`: The name of the SQL table to be read.
* `engine`: The connection enginer used to interface with the database.
* **Result**: A DataFrame containing all records from the `customers` table.

This is useful for retrieving entire SQL tables for data analysis or processing in Pandas.

In [6]:
# Reads the 'customers' table from the SQL database into a DataFrame
df = pd.read_sql_table("customers", engine)
df

   id    name phone_number
0   1  Donald   7326784567
1   2    Bill   6573489999
2   3    Modi   4567895646

## Reading Specific Columns from a SQL Table
The `read_sql_table()` function can be used to read only specific columns from a SQL table into a Pandas DataFrame. In this example, only the `name` and `phone_number` columns are retrieved from the `customers` table.

**Key Features:**
* `columns=['name', 'phone_number']`: Specifies which columns to retrieve from the SQL table.
* `engine`: The SQLAlchemy engine used to connect to the database.
* **Result**: A DataFrame containing only the selected columns from the `customers` table.

This is useful for reducing memory usage and focusing on relevant data.

In [7]:
# Reads only 'name' and 'phone_number' columns from the 'customers' table into a DataFrame
df = pd.read_sql_table("customers", engine, columns=['name','phone_number'])
df

     name phone_number
0  Donald   7326784567
1    Bill   6573489999
2    Modi   4567895646

## Executing SQL Query with `read_sql_query()`
The `read_sql_query()` function allows you to execute a custom SQL query and load the result into a Pandas DataFrame. In this example, a `JOIN` operation is performed between the `customers` and `orders` tables, retrieving relevant fields.

**Key Features:**
* **Custom Query**: You can write and execute any SQL query, including joins, filters, and aggregations.
* `engine`: The SQLAlchemy engine used to connect to the database.
* **Result**: A DataFrame containing the result of the SQL query.

This is useful for complex queries that require filtering or combining data from multiple tables.

In [8]:
query='''
SELECT customers.name, customers.phone_number, orders.name, orders.amount
 FROM customers INNER JOIN orders
 ON customers.id=orders.customer_id
'''
# Executes the SQL query and reads the result into a DataFrame
df = pd.read_sql_query(query, engine)
df

     name phone_number          name  amount
0    Bill   6573489999      Yoga Mat    20.0
1  Donald   7326784567  Google Pixel   950.0
2    Modi   4567895646  Fossil Watch   120.0

In [10]:
df = pd.read_csv("customers.csv")
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

## Renaming DataFrame Columns
The `rename()` function is used to change the names of columns in a DataFrame. In this examples, the columns `'Customer Name'` and `'Customer Phone'` are renamed to `'name'` and `'phone_number'`.

**Key Features:**
* `columns={}`: A dictionary specifying the old and new column names.
* `inplace=True`: Modifies the DataFrame in place without returning a new DataFrame.
* **Result:** A DataFrame with updated column names.

This is useful for cleaning up column names or making them more consistent and easier to work with.

In [12]:
df.rename(columns={
    'Customer Name': 'name',
    'Customer Phone': 'phone_number'
}, inplace=True)
# Renames columns 'Customer Name' and 'Customer Phone' to 'name' and 'phone_number'
df

              name  phone_number
0     rafael nadal    4567895647
1  maria sharapova     434534545
2   vladimir putin      89345345
3      kim un jong     123434456
4       jeff bezos     934534543
5     rahul gandhi      44324222

## Writing DataFrame to SQL with `to_sql()`
The `to_sql()` function allows you to write a DataFrame into an SQL table. In this examples, the DataFrame `df` is written to the `customers` table in the database, appending the data.

**Key Features**:
* `name='customers'`:Specifies the name of the SQL table.
* `con=engine`: The SQL Alchemy engine used to connect to the database.
* `index=False`: Prevents the DataFrame index from being written as a column in the SQL table.
* `if_exists='append'`: Appends the DataFrame to the existing table without overwriting it.

This is useful for adding new data to an existing SQL table directly from a DataFrame.

In [13]:
df.to_sql(
    name='customers',
    con=engine,
    index=False,
    if_exists='append'
    # Appends new data to the existing 'customers' table in the database
)

6

## Reading a SQL Table with `read_sql()`
The `read_sql()` function allows you to read an SQL table directly into a Pandas DataFrame. In this example, the entire `customers` table is retrieved using the `engine` connection.

**Key Features:**
* `"customers"`: The name of the SQL table to be read.
* `engine`: The SQLAlchemy engine used to connect to the database.
* **Result:** A DataFrame containing all records from the `customers` table.

This method is useful for retriexing and analyzing entire tables from a database directly in Pandas.

In [15]:
# Reads the 'customers' table from the database into a DataFrame
pd.read_sql("customers", engine)

   id             name phone_number
0   1           Donald   7326784567
1   2             Bill   6573489999
2   3             Modi   4567895646
3   4     rafael nadal   4567895647
4   5  maria sharapova    434534545
5   6   vladimir putin     89345345
6   7      kim un jong    123434456
7   8       jeff bezos    934534543
8   9     rahul gandhi     44324222

## Executing SQL Query with `read_sql()`
The `read_sql()` function can also execute a custom SQL query, not just read tables. In this example, an `INNER JOIN` between the `customers` and `orders` tables retrieces the specified columns.

**Key Features:**
* **Custom Query:** Executes a SQL query, including joins and filters.
* `engine`: SQLAlchemy engine used to connect to the database.
* **Result**: A DataFrame containing the query result.

This is ideal for running custom queries and loading the results into Pandas for analysis.

In [19]:
query='''
SELECT customers.name, customers.phone_number, orders.name, orders.amount
 FROM customers INNER JOIN orders
 ON customers.id=orders.customer_id
'''
# Executes the SQL query and loads the result into a DataFrame
pd.read_sql(query, engine)

     name phone_number          name  amount
0    Bill   6573489999      Yoga Mat    20.0
1  Donald   7326784567  Google Pixel   950.0
2    Modi   4567895646  Fossil Watch   120.0